app/controllers/areas_controller.rb

SELECT  "areas".* FROM "areas" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
  def index
    @areas = Area.all

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show()
    id = params['id']
    @area = Area.find_by(id: id)

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    id = params['id']
    @area = Area.find_by(id: id)

INSERT INTO "areas" ("nombre", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @area = Area.new(area_params)

    respond_to do |format|
      if @area.save

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "areas" SET "nombre" = $1, "updated_at" = $2 WHERE "areas"."id" = $3  [["nombre", "Informática editada"], ["updated_at", "2018-09-01 15:41:47.786844"], ["id", 1]]
---
  def update
    respond_to do |format|
      @area = Area.find_by(id: params[:id])
      if @area.update(area_params)

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_area
      @area = Area.find(params[:id])