app/controllers/cursos_controller.rb

INSERT INTO "cursos" ("nombre", "descripcion", "imagen", "incluye", "enfocado_a", "requisitos", "tiempo_estimado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @curso = Curso.new(curso_params)

    respond_to do |format|
      if @curso.save

SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_curso
      @curso = Curso.find(params[:id])