app/controllers/cursos_controller.rb

DELETE FROM "cursos_has_profs" WHERE "cursos_has_profs"."cursos_id" = $1  [["cursos_id", 2]]
SELECT "cursos_has_profs".* FROM "cursos_has_profs" WHERE "cursos_has_profs"."cursos_id" = $1  [["cursos_id", 2]]
INSERT INTO "cursos_has_profs" ("cursos_id", "created_at", "updated_at", "profesor_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cursos_id", 2], ["created_at", "2018-09-06 16:59:35.563634"], ["updated_at", "2018-09-06 16:59:35.563634"], ["profesor_id", 29]]
---
  def update
    respond_to do |format|
      if @curso.update(curso_params)
        CursosHasProf.where(cursos_id: @curso.id).destroy_all
        cursoProf = CursosHasProf.new
        cursoProf.cursos_id = @curso.id
        cursoProf.profesor_id = params['prof']
        cursoProf.save

SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_curso
      @curso = Curso.find(params[:id])