app/controllers/cursos_controller.rb

SELECT "cursos".* FROM "cursos"
---
  def index
    @cursos = Curso.all

SELECT "areas".* FROM "areas"
---
  def new
    @curso = Curso.new
    stn = "select usuarios.id, nombre, apellido, correo from usuarios "
    stn += "inner join data_usuarios on data_usuarios.usuarios_id=usuarios.id where "
    stn += "creado_por = #{getAdminId} and validado = #{VALIDADO} and estado = #{ACTIVO} and tipo = #{PROF} "
    #@profs = ActiveRecord::Base.connection.execute(stn)
    @profesores = Usuario.find_by_sql([stn])
    @areas = Area.all();

SELECT "areas".* FROM "areas"
SELECT  "cursos_has_profs".* FROM "cursos_has_profs" WHERE "cursos_has_profs"."cursos_id" = $1 LIMIT $2  [["cursos_id", 2], ["LIMIT", 1]]
---
  def edit
    stn = "select usuarios.id, nombre, apellido, correo from usuarios "
    stn += "inner join data_usuarios on data_usuarios.usuarios_id=usuarios.id where "
    stn += "creado_por = #{getAdminId} and validado = #{VALIDADO} and estado = #{ACTIVO} and tipo = #{PROF} "
    #@profs = ActiveRecord::Base.connection.execute(stn)
    @profesores = Usuario.find_by_sql([stn])
    @areas = Area.all();
    @act_prof = CursosHasProf.find_by(cursos_id: @curso.id)

INSERT INTO "cursos" ("nombre", "descripcion", "imagen", "incluye", "enfocado_a", "requisitos", "tiempo_estimado", "certificable", "estado", "created_at", "updated_at", "universidad_id", "areas_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
INSERT INTO "cursos_has_profs" ("cursos_id", "created_at", "updated_at", "profesor_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cursos_id", 2], ["created_at", "2018-09-02 20:43:03.708404"], ["updated_at", "2018-09-02 20:43:03.708404"], ["profesor_id", 29]]
SELECT "areas".* FROM "areas"
---
  def create
    @curso = Curso.new
    @curso.universidad_id = getAdminId
    @curso.estado = ACTIVO
    @curso.areas_id = params['curso']['areas_id']
    @curso.nombre = params['curso']['nombre']
    @curso.descripcion = params['curso']['descripcion']
    @curso.imagen = params['curso']['imagen']
    @curso.incluye = params['curso']['incluye']
    @curso.enfocado_a = params['curso']['enfocado_a']
    @curso.requisitos = params['curso']['requisitos']
    @curso.tiempo_estimado = params['curso']['tiempo_estimado']
    @curso.certificable = params['curso']['certificable']
    respond_to do |format|
      if @curso.save
        if params['curso']['certificable'] == '1'
          cursoHasProf = CursosHasProf.new
          cursoHasProf.cursos_id = @curso.id
          cursoHasProf.profesor_id = params['prof']
          cursoHasProf.save
        end

        format.html { redirect_to @curso, notice: 'El curso fue creado.' }
        format.json { render :show, status: :created, location: @curso }
      else
        stn = "select usuarios.id, nombre, apellido, correo from usuarios "
        stn += "inner join data_usuarios on data_usuarios.usuarios_id=usuarios.id where "
        stn += "creado_por = #{getAdminId} and validado = #{VALIDADO} and estado = #{ACTIVO} and tipo = #{PROF} "
        #@profs = ActiveRecord::Base.connection.execute(stn)
        @profesores = Usuario.find_by_sql([stn])
        @areas = Area.all();

UPDATE "cursos" SET "imagen" = $1, "updated_at" = $2 WHERE "cursos"."id" = $3  [["imagen", nil], ["updated_at", "2018-09-06 20:17:38.907325"], ["id", 2]]
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cursos" SET "imagen" = $1, "updated_at" = $2 WHERE "cursos"."id" = $3  [["imagen", "birrete.jpg"], ["updated_at", "2018-09-06 20:13:52.526460"], ["id", 2]]
SELECT "cursos_has_profs".* FROM "cursos_has_profs" WHERE "cursos_has_profs"."cursos_id" = $1  [["cursos_id", 2]]
DELETE FROM "cursos_has_profs" WHERE "cursos_has_profs"."cursos_id" = $1  [["cursos_id", 2]]
INSERT INTO "cursos_has_profs" ("cursos_id", "created_at", "updated_at", "profesor_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cursos_id", 2], ["created_at", "2018-09-06 20:13:52.563890"], ["updated_at", "2018-09-06 20:13:52.563890"], ["profesor_id", 31]]
---
  def update
    respond_to do |format|
      @curso.nombre = params['curso']['nombre']
      @curso.descripcion = params['curso']['descripcion']
      @curso.incluye = params['curso']['incluye']
      @curso.enfocado_a = params['curso']['enfocado_a']
      @curso.requisitos = params['curso']['requisitos']
      @curso.tiempo_estimado = params['curso']['tiempo_estimado']
      @curso.certificable = params['curso']['certificable']
      @curso.areas_id = params['curso']['areas_id']
      unless params['curso']['imagen'].blank?
        @curso.remove_imagen!
      end
      if @curso.save
        unless params['curso']['imagen'].blank?
          cursoModel = Curso.find(@curso.id)
          cursoModel.imagen = params['curso']['imagen']
          cursoModel.save!
        end

        CursosHasProf.where(cursos_id: @curso.id).delete_all;
        cursoProf = CursosHasProf.new
        cursoProf.cursos_id = @curso.id
        cursoProf.profesor_id = params['prof']
        cursoProf.save

SELECT "areas".* FROM "areas"
SELECT  "cursos_has_profs".* FROM "cursos_has_profs" WHERE "cursos_has_profs"."cursos_id" = $1 LIMIT $2  [["cursos_id", 2], ["LIMIT", 1]]
---
        stn += "creado_por = #{getAdminId} and validado = #{VALIDADO} and estado = #{ACTIVO} and tipo = #{PROF} "
        #@profs = ActiveRecord::Base.connection.execute(stn)
        @profesores = Usuario.find_by_sql([stn])
        @areas = Area.all();
        @act_prof = CursosHasProf.find_by(cursos_id: @curso.id)

SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_curso
      @curso = Curso.find(params[:id])