app/controllers/login_controller.rb

SELECT  "data_usuarios".* FROM "data_usuarios" WHERE "data_usuarios"."usuarios_id" = $1 LIMIT $2  [["usuarios_id", 24], ["LIMIT", 1]]
---
  def ingreso
    correo = params[:correo]
    password = params[:password]
    usuarioModel = Usuario.new
    data = usuarioModel.valida_usuario(correo, password)
    if data[0] == true
      reset_session
      usuarioData = DataUsuario.find_by(usuarios_id: data[1][:id])

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."correo" = $1 LIMIT $2  [["correo", "pfr@gmail.com"], ["LIMIT", 1]]
SELECT  "data_usuarios".* FROM "data_usuarios" WHERE "data_usuarios"."usuarios_id" = $1 LIMIT $2  [["usuarios_id", 24], ["LIMIT", 1]]
UPDATE "usuarios" SET "cod_recovery" = $1, "updated_at" = $2 WHERE "usuarios"."id" = $3  [["cod_recovery", 5067], ["updated_at", "2018-09-06 01:24:42.409791"], ["id", 24]]
---
  def recuperar
    correo = params[:correo]
    usuario = Usuario.find_by(correo: correo)
    dataUsuario = DataUsuario.find_by(usuarios_id: usuario.id)
    unless usuario.blank?
      codrecovery = rand(9999)
      usuario.cod_recovery = codrecovery
      usuario.save

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."cod_recovery" = $1 AND "usuarios"."id" = $2 LIMIT $3  [["cod_recovery", 5067], ["id", 24], ["LIMIT", 1]]
---
  def nuevapsw
    @valin = params['in']
    @alert = params['alert']
    valor = @valin.split("_")
    cod = desencriptar(valor[0].to_i)
    id = desencriptar(valor[1].to_i)
    data = Usuario.find_by(cod_recovery: cod, id: id)

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."cod_recovery" = $1 AND "usuarios"."id" = $2 LIMIT $3  [["cod_recovery", 0], ["id", 0], ["LIMIT", 1]]
UPDATE "usuarios" SET "psw" = $1, "updated_at" = $2 WHERE "usuarios"."id" = $3  [["psw", "5cbadf2df29b0fff0b4e4da0f36665a0"], ["updated_at", "2018-09-06 01:35:47.537133"], ["id", 24]]
---
  def cambio
    psw = params['psw']
    valida = params['valida']
    ingreso = params['in']
    iguales = psw <=> valida

    if iguales == 0
      valor = ingreso.split("_")
      cod = desencriptar(valor[0].to_i)
      id = desencriptar(valor[1].to_i)
      usuario = Usuario.find_by(cod_recovery: cod, id: id)
      if usuario.blank?
        redirect_to({:action=>"index", :controller=>"perfil"})
      else
        usuario.psw = encriptaTexto(psw)
        usuario.save