app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("nombre", "tipo", "correo", "estado", "cod_recovery", "validado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def profesor
    sentencia = "select usuarios.id, nombre, correo, estado, validado, usuarios.created_at, foto, apellido "

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."correo" = $1 LIMIT $2  [["correo", "pfr@gmail.com"], ["LIMIT", 1]]
INSERT INTO "data_usuarios" ("apellido", "usuarios_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["apellido", "Suarez"], ["usuarios_id", 33], ["created_at", "2018-09-06 16:26:34.170225"], ["updated_at", "2018-09-06 16:26:34.170225"]]
INSERT INTO "usuarios" ("nombre", "tipo", "correo", "psw", "estado", "cod_recovery", "validado", "created_at", "updated_at", "creado_por") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def crea_usuario
    correo = params['correo']
    nombre = params['nombre']
    apellido = params['apellido']
    data = Usuario.find_by(correo: correo)

    if data.blank?
      usuModel = Usuario.new
      dataUsuModel = DataUsuario.new
      usuModel.nombre = nombre
      usuModel.correo = correo
      #Si el usuario actual es administrador, crea una universidad
      if getTipo == ADM
          usuModel.tipo = UNIV
          alerta = "Usuario creado. Se le ha enviado un correo electrónico a la universidad para que active y complete el registro"
          accion = "universidad"
      end
      #Si el usuario actual es universidad, crea un profesor
      if getTipo == UNIV
        usuModel.tipo = PROF
        alerta = "Usuario creado. Se le ha enviado un correo electrónico al profesor para que active y complete el registro"
        accion = "profesor"
      end
      #
      usuModel.estado = ACTIVO
      usuModel.validado = SIN_VALIDAR
      usuModel.cod_recovery = rand(9999)
      usuModel.psw = encriptaTexto(rand(9999999).to_s)
      usuModel.creado_por = getAdminId
      usuModel.save