app/controllers/usuarios_controller.rb

  def crea_u
    correo = params['correo']
    nombre = params['nombre']
    apellido = params['apellido']
    data = Usuario.find_by(correo: correo)

    if data.blank?
      usuModel = Usuario.new
      dataUsuModel = DataUsuario.new
      usuModel.nombre = nombre
      usuModel.correo = correo
      #Si el usuario actual es administrador, crea una universidad
      if getTipo == ADM
          usuModel.tipo = UNIV
          alerta = "Usuario creado. Se le ha enviado un correo electrónico a la universidad para que active y complete el registro"
          accion = "universidad"
      end
      #Si el usuario actual es universidad, crea un profesor
      if getTipo == UNIV
        usuModel.tipo = PROF
        alerta = "Usuario creado. Se le ha enviado un correo electrónico al profesor para que active y complete el registro"
        accion = "profesor"
      end
      #
      usuModel.estado = ACTIVO
      usuModel.validado = SIN_VALIDAR
      usuModel.cod_recovery = rand(9999)
      usuModel.psw = encriptaTexto(rand(9999999).to_s)
      usuModel.save
      #Guardar los datos del modelo DataUsuario
      dataUsuModel.usuarios_id = usuModel.id
      dataUsuModel.apellido = apellido
      dataUsuModel.save
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."correo" = $1 LIMIT $2  [["correo", "fantasmalogia@gmail.com"], ["LIMIT", 1]]
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."correo" = $1 LIMIT $2  [["correo", "gerencia@salle.com"], ["LIMIT", 1]]
INSERT INTO "data_usuarios" ("apellido", "usuarios_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["apellido", "Páramo"], ["usuarios_id", 25], ["created_at", "2018-08-30 05:28:33.826371"], ["updated_at", "2018-08-30 05:28:33.826371"]]
INSERT INTO "usuarios" ("nombre", "tipo", "correo", "psw", "estado", "cod_recovery", "validado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "data_usuarios" ("apellido", "usuarios_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["apellido", "Páramo"], ["usuarios_id", 26], ["created_at", "2018-08-30 05:38:18.670347"], ["updated_at", "2018-08-30 05:38:18.670347"]]

  def conf_universidad
    reset_session
    @valin = params['in']
    @alert = params['alert']
    valor = @valin.split("_")
    cod = desencriptar(valor[0].to_i)
    id = desencriptar(valor[1].to_i)
    data = Usuario.find_by(cod_recovery: cod, id: id)
    if data.blank?
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."cod_recovery" = $1 AND "usuarios"."id" = $2 LIMIT $3  [["cod_recovery", 7036], ["id", 29], ["LIMIT", 1]]
SELECT  "data_usuarios".* FROM "data_usuarios" WHERE "data_usuarios"."usuarios_id" = $1 LIMIT $2  [["usuarios_id", 24], ["LIMIT", 1]]

  def usuario_data
    psw = params['psw']
    conf = params['confirmar']
    foto = params['foto']
    valin = params['in']
    val = true
    iguales = psw <=> conf

    if iguales == 0
      if foto.blank? == false
        usuario = Usuario.find_by(id: session[:id])
        datausu = DataUsuario.find_by(usuarios_id: session[:id])
        datausu.foto = params['foto']
        datausu.save!
        usuario.psw = encriptaTexto(psw)
        usuario.validado = VALIDADO
        usuario.save
---
SELECT  "data_usuarios".* FROM "data_usuarios" WHERE "data_usuarios"."usuarios_id" = $1 LIMIT $2  [["usuarios_id", 24], ["LIMIT", 1]]
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
SELECT  "data_usuarios".* FROM "data_usuarios" WHERE "data_usuarios"."usuarios_id" = $1 LIMIT $2  [["usuarios_id", 29], ["LIMIT", 1]]
UPDATE "usuarios" SET "psw" = $1, "validado" = $2, "updated_at" = $3 WHERE "usuarios"."id" = $4  [["psw", "c812c97c9a70d6dd8605dc3940625944"], ["validado", 1], ["updated_at", "2018-08-30 04:54:13.528715"], ["id", 24]]
UPDATE "data_usuarios" SET "foto" = $1, "updated_at" = $2 WHERE "data_usuarios"."id" = $3  [["foto", "prof.jpeg"], ["updated_at", "2018-08-30 06:01:06.652632"], ["id", 7]]
UPDATE "usuarios" SET "psw" = $1, "validado" = $2, "updated_at" = $3 WHERE "usuarios"."id" = $4  [["psw", "c6028ac63a29652e2c11e93eff395953"], ["validado", 1], ["updated_at", "2018-08-30 06:01:06.684148"], ["id", 29]]