app/models/usuario.rb

  def valida_usuario(correo, clave)
    data = Usuario.find_by(correo: correo, estado: ACTIVO, validado: VALIDADO)
    if data.blank?
      data1 = Usuario.find_by(correo: correo, estado: ACTIVO)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."correo" = $1 AND "usuarios"."estado" = $2 AND "usuarios"."validado" = $3 LIMIT $4  [["correo", "cifuentesrfelipe@gmail.com"], ["estado", 1], ["validado", 1], ["LIMIT", 1]]
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."correo" = $1 AND "usuarios"."estado" = $2 LIMIT $3  [["correo", "cifuentesrfelipe@gmail.com"], ["estado", 1], ["LIMIT", 1]]